      * ================================================================
      * Setting up...
      * We just need to validate that the compiler is working.
      * 
      * Run the following commands to compile and run the program.
      * ----------------------------------------------------------------
      * $ cobc -x HELLO.cbl
      * $ ./HELLO
      * ================================================================ 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY 'HELLO WORLD'.
           STOP RUN.

