      * ================================================================
      * DEFINITIONS NEEDED FOR PARAGRAPH
      * ================================================================
           01 CA-AGE          PIC        9(3).
           01 CA-YEAR         PIC        9(4).
           01 CA-MONTH        PIC        9(2).
           01 CA-DAY          PIC        9(2).
           01 CA-TODAY.
              05 CA-TODAY-Y   PIC        9(4).
              05 CA-TODAY-M   PIC        9(2).
              05 CA-TODAY-D   PIC        9(2).
      