       IDENTIFICATION DIVISION.
       PROGRAM-ID. PFMUPGM.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 WS-COUNT  PIC 9(3) VALUE 0.
       PROCEDURE DIVISION.
       PARA-MAIN.
           PERFORM PARA-100 UNTIL WS-COUNT > 5.
           STOP RUN.

       PARA-100.
           DISPLAY 'WS-COUNT: ' WS-COUNT.
           COMPUTE WS-COUNT = WS-COUNT + 1.
