       IDENTIFICATION DIVISION.
       PROGRAM-ID. PFMVPGM.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 WS-COUNT PIC 9(3) VALUE 0.
       PROCEDURE DIVISION.
       PARA-MAIN.
           PERFORM PARA-A VARYING WS-COUNT FROM 1 BY 1 UNTIL
                                  WS-COUNT = 5.
           STOP RUN.

       PARA-A.
           DISPLAY 'WS-COUNT ' WS-COUNT.
