       IDENTIFICATION DIVISION.
       PROGRAM-ID. PFMXPGM.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 WS-COUNT PIC 9(3) VALUE 1.
       PROCEDURE DIVISION.
       PARA-MAIN.
           PERFORM PARA-A 5 TIMES.
           STOP RUN.
       PARA-A.
           DISPLAY 'WS-COUNT: ' WS-COUNT.
           COMPUTE WS-COUNT = WS-COUNT + 1.
